ctx-agent/ctx/lib/retr-template-001.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing">
  <soapenv:Header>
    <wsa:MessageID soapenv:mustUnderstand="0">uuid:REPLACE_MESSAGE_ID</wsa:MessageID>
    <wsa:To soapenv:mustUnderstand="0">REPLACE_SERVICE_URL</wsa:To>
    <wsa:Action soapenv:mustUnderstand="0">
    http://www.globus.org/2008/12/nimbus/contextualization/NimbusContextBrokerPortType/retrieveRequest</wsa:Action>
    <wsa:From soapenv:mustUnderstand="0">
      <wsa:Address>
      http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address>
    </wsa:From>
    <ns2:NimbusContextBrokerKey xmlns:ns2="http://www.globus.org/2008/12/nimbus/contextualization"
    soapenv:mustUnderstand="0">REPLACE_RESOURCE_KEY</ns2:NimbusContextBrokerKey>
  </soapenv:Header>
  <soapenv:Body>
    <retrieve xmlns="http://www.globus.org/2008/12/nimbus/contextualization">

      <ns1:identity xmlns:ns1="http://www.globus.org/2008/12/nimbus/ctxdescription">

        <ns1:interface>REPLACE_IFACE_NAME</ns1:interface>
        <ns1:ip>REPLACE_IFACE_IP</ns1:ip>
        <ns1:hostname>REPLACE_IFACE_HOSTNAME</ns1:hostname>
        <ns1:pubkey>REPLACE_IFACE_SSH_KEY</ns1:pubkey>
      </ns1:identity>
      
      REPLACE_CLUSTER_XML
      
    </retrieve>
  </soapenv:Body>
</soapenv:Envelope>

